#+title: Deploying OpenFaaS on Digital Ocean with Terraform
#+subtitle: Everything functional
#+tags: openfaas, kubernetes, terraform, helm
#+date: 2021-06-02

We are going to look at how to use Terraform to deploy a Kubernetes
cluster on Digital Ocean, add a managed postgres database, and redis
and OpenFaaS in kubernetes.  This will show how to use Terraform to
manage the configuration and how we can access both cloud and
kubernetes managed services from OpenFaaS functions.

We are going to use the [[https://registry.terraform.io/providers/digitalocean/digitalocean/latest/docs][digitalocean]], [[https://registry.terraform.io/providers/hashicorp/kubernetes/latest/docs][kubernetes]], and [[https://registry.terraform.io/providers/hashicorp/helm/latest][helm]] terraform
providers.

** Setup =kubectl=

#+begin_src bash
  export CLUSTER_ID=$(terraform output -raw cluster-id)
  mkdir -p ~/.kube/
  curl -X GET \
  -H "Content-Type: application/json" \
  -H "Authorization: Bearer ${TF_VAR_do_token}" \
  "https://api.digitalocean.com/v2/kubernetes/clusters/$CLUSTER_ID/kubeconfig" \
  > ~/.kube/config
#+end_src

If you have your =TF_VAR_do_token= setup correctly, it should create a
valid =config= file.

Test this with

#+begin_src bash :results output
kubectl cluster-info
#+end_src

#+RESULTS:
: Kubernetes control plane is running at https://39cef8c8-ca33-40f1-9454-3373707a22ef.k8s.ondigitalocean.com
: CoreDNS is running at https://39cef8c8-ca33-40f1-9454-3373707a22ef.k8s.ondigitalocean.com/api/v1/namespaces/kube-system/services/kube-dns:dns/proxy
: 
: To further debug and diagnose cluster problems, use 'kubectl cluster-info dump'.

** Verifying OpenFaaS

We can then verify the deploy with:

#+begin_src bash
kubectl -n openfaas get deployments -l "release=openfaas, app=openfaas"
#+end_src

#+RESULTS:
| NAME              | READY | UP-TO-DATE | AVAILABLE | AGE |
| alertmanager      | 1/1   |          1 |         1 | 19m |
| basic-auth-plugin | 1/1   |          1 |         1 | 19m |
| gateway           | 1/1   |          1 |         1 | 19m |
| nats              | 1/1   |          1 |         1 | 19m |
| prometheus        | 1/1   |          1 |         1 | 19m |
| queue-worker      | 1/1   |          1 |         1 | 19m |

** Get the OpenFaaS login credentials and login

#+begin_src bash :results output
# This command retrieves your password
PASSWORD=$(kubectl get secret -n openfaas basic-auth -o jsonpath="{.data.basic-auth-password}" | base64 --decode; echo)

# This command logs in and saves a file to ~/.openfaas/config.yml
echo -n $PASSWORD | faas-cli login --username admin --password-stdin
#+end_src

#+RESULTS:
: Calling the OpenFaaS server to validate the credentials...
: credentials saved for admin http://127.0.0.1:8080

And now we can list out our deployed functions:

#+begin_src bash
faas-cli list
#+end_src

#+RESULTS:
| Function | Invocations | Replicas |

Not a whole lot there yet.

** Testing out deploying a function

#+begin_src bash :results output
faas-cli store deploy nodeinfo
echo | faas-cli invoke nodeinfo
#+end_src

#+RESULTS:
#+begin_example

Deployed. 202 Accepted.
URL: http://127.0.0.1:8080/function/nodeinfo

Hostname: nodeinfo-8545846564-wpqm6

Arch: x64
CPUs: 2
Total mem: 1995MB
Platform: linux
Uptime: 361
#+end_example

** Get the template running
Lets create our first function.  We need to pull the templates locally, so lets do that with:

#+begin_src bash :results output
faas-cli template pull
#+end_src

#+RESULTS:
: Fetch templates from repository: https://github.com/openfaas/templates.git at 

And create our function, I'm going to use ruby.

#+begin_src bash :results output
faas-cli new --lang ruby rubyredis
#+end_src


Change the =image= in =rubyredis.yml= to be your Docker hub user name, and
then lets deploy it:

#+begin_src bash :results output
faas-cli up -f rubyredis.yml
#+end_src

And if that's successful, we can invoke it with:

#+begin_src bash :results output
echo | faas-cli invoke rubyredis
#+end_src

#+RESULTS:
: Hello world from the Ruby template

** Start a remplate

#+begin_src bash
faas-cli new --lang ruby rubypostgres
#+end_src

Then lets tweak the =rubypostgres.yml= file to add the secret (and
docker username!)

#+begin_src yaml :tangle rubypostgres.yml
  version: 1.0
  provider:
    name: openfaas
    gateway: http://127.0.0.1:8080
  functions:
    rubypostgres:
      lang: ruby
      handler: ./rubypostgres
      image: wschenk/rubypostgres:latest
      build_args:
        ADDITIONAL_PACKAGE: build-base postgresql-dev
      secrets:
      - postgresconnection
#+end_src

Then we need to add the 'pg' gem:

#+begin_src ruby :tangle rubypostgres/Gemfile
  source 'https://rubygems.org'

  gem "pg", "~> 1.2"
  gem "database_url"
  gem "json"
#+end_src

Then in the handler

#+begin_src ruby :tangle rubypostgres/handler.rb
  require 'json'
  require 'database_url'
  require 'pg'

  class Handler
    def run(req)
      c = DatabaseUrl.to_active_record_hash(File.read( '/var/openfaas/secrets/host' ) )

  #    {"adapter":"postgresql","host":"private-gratitude-postgres-cluster-do-user-1078430-0.b.db.ondigitalocean.com","database":"defaultdb","port":25060,"user":"doadmin","password":"ievezzbyz0a1stxa"}

      # Output a table of current connections to the DB
      conn = PG.connect(
        c[:host],
        c[:port],
        nil,
        nil,
        c[:database],
        c[:user],
        c[:password] )

      r = []
      conn.exec( "SELECT * FROM pg_stat_activity" ) do |result|
        r << "     PID | User             | Query"
        result.each do |row|
          r << " %7d | %-16s | %s " %
               row.values_at('pid', 'usename', 'query')
        end
      end

      return r.join( "\n" );
    end
  end
#+end_src

Now we build it:

#+begin_src bash :results output
faas-cli up -f rubypostgres.yml
#+end_src

And invoke:

#+begin_src bash :results output
echo | faas-cli invoke rubypostgres
#+end_src

#+RESULTS:
#+begin_example
     PID | User             | Query
      76 | postgres         | <insufficient privilege> 
      69 | postgres         | <insufficient privilege> 
      65 |                  | <insufficient privilege> 
      67 | postgres         | <insufficient privilege> 
      72 | postgres         | <insufficient privilege> 
      78 | _dodb            | <insufficient privilege> 
   22113 | doadmin          | SELECT * FROM pg_stat_activity 
      63 |                  | <insufficient privilege> 
      62 |                  | <insufficient privilege> 
      64 |                  | <insufficient privilege> 
#+end_example

